---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Railing.HasHost
zh: 栏杆
source: html/c977dcea-a003-cd92-5381-91efe270d055.htm
---
# Autodesk.Revit.DB.Architecture.Railing.HasHost Property

**中文**: 栏杆

Indicates if the railing has a host.

## Syntax (C#)
```csharp
public bool HasHost { get; }
```